select
	unix_timestamp()                                   --1545707968
	,unix_timestamp('1970-01-01 08:00:00')             --0
    ,unix_timestamp('2018-12-24 16:11:11')             --1545639071
    ,unix_timestamp('2018-12-24 16:11:12')             --1545639071+1
    ,unix_timestamp('2018-12-24 16:12:11')             --1545639071+60
    ,unix_timestamp('2018-12-24 17:11:11')             --1545639071+60*60
    ,unix_timestamp('2018-12-25 16:11:11')             --1545639071+60*60*24
    ,unix_timestamp('2019-01-24 16:11:11')             --1545639071+60*60*24*31
	,current_date                                      --当前查询日期, 2018-12-24
	,current_timestamp                                 --当前查询时间, 2018-12-24 16:35:57.211

    ,from_unixtime(unix_timestamp())                    --查询时间，2019-11-12 18:30:20

    --日期计算
    ,date_add('2018-12-24', 1)            --2018-12-25
    ,date_add('2018-12-24', -1)           --2018-12-23
    ,date_sub('2018-12-24', 1)            --2018-12-23
    ,date_sub('2018-12-24', -1)           --2018-12-25
    ,add_months('2018-12-24', 2)                            --增加X个月, 2019-2-24

    ,datediff('2018-12-24', '2018-12-20')                   --4,日期之间相差天数
    ,months_between('2018-12-24', '2018-01-01')             --相差月份, 11.74193548

    ,pmod(datediff('2020-08-05', '2012-01-01'), 7) as weekday    --周X
    ,dayofmonth(current_date)
    ,trunc('2018-12-24', 'MM')                              --当月第一天, 2018-12-01
    ,trunc('2018-12-24', 'YY')                              --当年第一天, 2018-01-01
    ,trunc(add_months('2018-12-24',-1), 'MM')               --上月第一天, 2018-11-01
    ,last_day(trunc(add_months('2018-12-24',-1), 'MM'))     --上月最后一天, 2018-11-30
    ,date_sub(trunc('2018-12-24', 'MM'), 1)                 --上月最后一天, 2018-11-30
    ,last_day('2018-12-24')                                 --当月最后一天, 2018-12-31
    ,next_day('2018-12-24', 'Friday')                       --下一个星期X, 2018-12-28
    
    --时间信息
    ,year('2018-12-24')                                    --2018
    ,ceil(month('2018-12-24')/3.0)                         --4.0,季度
    ,month('2018-12-24')                                   --12
    ,weekofyear('2018-12-24')                              --52
    ,day('2018-12-24')                                     --24
    ,hour('2018-12-24 16:11:11')                           --16
    ,minute('2018-12-24 16:11:11')                         --11
    ,second('2018-12-24 16:11:11')                         --11

    --字符串转时间
    ,to_date('2018-12-24 16:11:11')                         --2018-12-24
    ,to_date('2018-12-24')                                 --2018-12-24
    ,date_format('2018-12-24', 'MM-dd')                     --返回指定格式时间, 12-24
    ,date_format('2018-12-24 13:24:21', 'yyyyMMdd')        --返回20181224
    ,date_format('2018-12-24 13:24:21', 'yyMMdd')          --返回181224
    ,date_format('2018-12-24 13:24:21', 'yyyy-MM-dd')      --返回2018-12-24
    ,date_format('2018-12-24 13:24:21', 'yyyyMMdd000000')  --20181224000000